Extensions/ИнтеграцияGreenApi/DataProcessors/iga_РедакторШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>iga_РедакторШаблонов</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_КатегорииШаблонов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_КатегорииШаблонов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Маркетинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утилита</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/Enums/iga_ТипыКнопокСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>iga_ТипыКнопокСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПереходПоСсылке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ответ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерТелефона</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/ИнтеграцияGreenApi/DataProcessors/iga_РедакторШаблонов/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ТекстСообщенияHTMLДокументСформирован(Элемент)
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(ЭтаФорма.ТекстСообщения, Элементы.ТекстСообщения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПараметров(ТекстСообщения)
	
	Если ПустаяСтрока(ТекстСообщения) Тогда
		Возврат;
	КонецЕсли;
	
	// 1. Используем регулярное выражение для поиска текста в фигурных скобках
	// Шаблон \{([^}]+)\} означает: найти "{", захватить всё, что не является "}", и найти "}"
	RegExp = Новый COMОбъект("VBScript.RegExp");
	RegExp.IgnoreCase = Истина; // Игнорировать регистр
	RegExp.Global     = Истина; // Искать все вхождения
	RegExp.MultiLine  = Истина;
	RegExp.Pattern    = "\{([^}]+)\}";
	
	Попытка
		Matches = RegExp.Execute(ТекстСообщения);
	Исключение
		Сообщить("Ошибка при разборе текста алгоритма: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ЭтаФорма.ПараметрыШаблона.Очистить();
	
	СчетчикПараметров = 0;
	Для Каждого Match Из Matches Цикл
		
		СчетчикПараметров = СчетчикПараметров + 1;
		
		ИмяИзТекста = Match.SubMatches(0);
		
		СтрокаПараметра = ЭтаФорма.ПараметрыШаблона.Добавить();
		СтрокаПараметра.Номер = СчетчикПараметров;
		СтрокаПараметра.ИмяПараметра = ИмяИзТекста;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Обработчик_ПослеВводаТекста(ТекстРезуьтат, ДопПараметры) Экспорт 
	
	Если ТекстРезуьтат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.ТекстСообщения = ТекстРезуьтат;
	
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(ЭтаФорма.ТекстСообщения, Элементы.ТекстСообщения);
	
	ОбновитьСписокПараметров(ЭтаФорма.ТекстСообщения);
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура Редактировать(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("Обработчик_ПослеВводаТекста", ЭтаФорма);
	
	ОткрытьФорму("Обработка.iga_РедакторТекстаHTML.Форма.Форма", Новый Структура("ТекстДляРедактирования", ЭтаФорма.ТекстСообщения), ЭтаФорма,
		,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекстСообщенияHTML = iga_HTMLКлиент.ПолучитьИзначальныйТексСтраницы(Истина);

КонецПроцедуры


&НаСервере
Процедура ПрочитатьШаблонНаСервере()
	
	Бот = Обработки.iga_ChatBot.Создать();
	Бот.ИнициализацияОсновныхПараметров();
	МассивШаблонов = Бот.ПолучитьСписокШаблонов();
	
	Идентификаторы = Новый Массив;
	
	Для Каждого СтруктураШаблона Из МассивШаблонов.templates Цикл
		Если Не СтруктураШаблона.category = "MARKETING"
			И Не СтруктураШаблона.category = "UTILITY" Тогда
			Продолжить;
		КонецЕсли;
		Идентификаторы.Добавить(СтруктураШаблона.templateId);
	КонецЦикла;
	
	Для Каждого Шаблон Из МассивШаблонов.templates Цикл
		
		Если Не Шаблон.templateId = Идентификатор Тогда
			Продолжить;
		КонецЕсли;
		
		Если Не Шаблон.templateType = "TEXT" Тогда
			Продолжить;
		КонецЕсли;
		
		Если Шаблон.state = "ACTIVE" и Шаблон.status = "APPROVED" Тогда
			
			ЭтаФорма.Утвержден = Истина;
			
			containerMeta = ПрочитатьЗначениеJSON(Шаблон.containerMeta);
			
			Если Шаблон.Свойство("vertical") Тогда
				ЭтаФорма.КраткоеОписание = Шаблон.vertical;
			КонецЕсли;
			
			ЭтаФорма.ТекстСообщения = containerMeta.data;
			Если Шаблон.category = "MARKETING" Тогда
				ЭтаФорма.Категория = Перечисления.iga_КатегорииШаблонов.Маркетинг;
			Иначе
				ЭтаФорма.Категория = Перечисления.iga_КатегорииШаблонов.Утилита;
			КонецЕсли;
			ЭтаФорма.Кнопки.Очистить();
			Если containerMeta.Свойство("buttons") Тогда
				Для Каждого СтруктураКнопки Из containerMeta.buttons Цикл
					СтрокаКнопки = ЭтаФорма.Кнопки.Добавить();
					Если СтруктураКнопки.type = "URL" Тогда
						СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.ПереходПоСсылке;
						СтрокаКнопки.Значение = СтруктураКнопки.url;
					ИначеЕсли СтруктураКнопки.type = "QUICK_REPLY" Тогда
						СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.Ответ;
					Иначе
						СтрокаКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.НомерТелефона;
						СтрокаКнопки.Значение = СтруктураКнопки.phone_number;
					КонецЕсли;
					СтрокаКнопки.Заголовок = СтруктураКнопки.text;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры


&НаКлиенте
Процедура ПрочитатьШаблон(Команда)
	ПрочитатьШаблонНаСервере();
	iga_HTMLКлиент.ПрименитьТекстКПолюHTML(ЭтаФорма.ТекстСообщения, Элементы.ТекстСообщения);
КонецПроцедуры


&НаКлиенте
Процедура ОтправитьШаблонНаУтверждение(Команда)
	ОтправитьШаблонНаУтверждениеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ОтправитьШаблонНаУтверждениеНаСервере()
	
	ИдеальноеНаименование = iga_ОбщегоНазначенияКлиентСервер.ИдеальноеИмяФайла(ЭтаФорма.Наименование);
	Если ИдеальноеНаименование = "" Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Необходимо заполнить корректно наименование.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	Если ЭтаФорма.Идентификатор = "" Тогда
		
		СтруктураШаблона = Новый Структура;
		СтруктураШаблона.Вставить("elementName", ИдеальноеНаименование);
		СтруктураШаблона.Вставить("languageCode", ?(ЭтаФорма.Язык = Справочники.iga_ЯзыкиЧатов.Казахский, "kk", "ru"));
		СтруктураШаблона.Вставить("category", ?(ЭтаФорма.Категория = Перечисления.iga_КатегорииШаблонов.Маркетинг, "MARKETING", "UTILITY"));
		СтруктураШаблона.Вставить("templateType", "TEXT");
		СтруктураШаблона.Вставить("vertical", ЭтаФорма.КраткоеОписание);

		ОтправляемыйТекст = ЭтаФорма.ТекстСообщения;
		Для Каждого СтрокаПараметра Из ЭтаФорма.ПараметрыШаблона Цикл
			ОтправляемыйТекст = СтрЗаменить(ОтправляемыйТекст, "{" + СтрокаПараметра.ИмяПараметра + "}", "{{" + СтрокаПараметра.Номер + "}}");
		КонецЦикла;
		СтруктураШаблона.Вставить("content", ОтправляемыйТекст);
		Если Не ЭтаФорма.ЗаголовокСообщения = "" Тогда
			СтруктураШаблона.Вставить("header", ЭтаФорма.ЗаголовокСообщения);
			СтруктураШаблона.Вставить("exampleHeader", ЭтаФорма.ЗаголовокСообщения);
		КонецЕсли;
		
		ТекстПримера = ЭтаФорма.ТекстСообщения;
		Для Каждого СтрокаПараметра Из ЭтаФорма.ПараметрыШаблона Цикл
			ТекстПримера = СтрЗаменить(ТекстПримера, "{" + СтрокаПараметра.ИмяПараметра + "}", СтрокаПараметра.ЗначениеПримера);
		КонецЦикла;
		СтруктураШаблона.Вставить("example", ТекстПримера);
		Если ЭтаФорма.Кнопки.Количество() > 0 Тогда
			МассивКнопок = Новый Массив;
			СтруктураШаблона.Вставить("buttons", ЗаписатьЗначениеJSON(МассивКнопок));
			Для Каждого ДанныеКнопки Из ЭтаФорма.Кнопки Цикл
				СтруктураКнопки = Новый Структура;
				МассивКнопок.Добавить(СтруктураКнопки);
				
				Если ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.Ответ Тогда
					СтруктураКнопки.Вставить("type", "QUICK_REPLY");
				ИначеЕсли ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.ПереходПоСсылке Тогда
					СтруктураКнопки.Вставить("type", "URL ");
					СтруктураКнопки.Вставить("url", ДанныеКнопки.Значение);
				ИначеЕсли ДанныеКнопки.Тип = Перечисления.iga_ТипыКнопокСообщения.НомерТелефона Тогда
					СтруктураКнопки.Вставить("type", "PHONE_NUMBER");
					СтруктураКнопки.Вставить("phone_number", ДанныеКнопки.Значение);
				КонецЕсли;
				СтруктураКнопки.Вставить("text", ДанныеКнопки.Заголовок);
			КонецЦикла;
			
		КонецЕсли;
		ТелоЗапроса = ЗаписатьЗначениеJSON(СтруктураШаблона);
		
		Бот = Обработки.iga_ChatBot.Создать();
		Бот.ИнициализацияОсновныхПараметров();
		Результат = Бот.СоздатьШаблонСообщения(СтруктураШаблона);
		Если Результат = Неопределено Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не удалось создать шаблон.";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		ЭтаФорма.Идентификатор = Результат.template.templateId;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Шаблон успешно создан.";
		Сообщение.Сообщить();
		
	КонецЕсли;
	
КонецПроцедуры
